       identification division.
           program-id. hello_world.

       data division.
       working-storage section.

       procedure division.
           display "Hello, World!".

       end program hello_world.